import calendar
import datetime

day = int(input('Введіть день вашого народження: '))
month = int(input('Введіть місяць вашого народження: '))
max_day = calendar.monthrange(2023, month)[1]

if not (1 <= day <= max_day and 1 <= month <= 12):
    print('Помилка, день або місяць неправильний!')
    exit()

user_date = datetime.date(2023, month, day)
if datetime.date(2023, 1, 21) <= user_date <= datetime.date(2023, 2, 18):
    print('Ти Водолій')
    print(
        'Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі речі, як-от хобі. Одне з них — випікання, традиційне для українців ремесло, яке не тільки демонструє глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та фокусуванню на важливому тут і зараз.'
    )
elif datetime.date(2023, 2, 19) <= user_date <= datetime.date(2023, 3, 20):
    print('Ти Риби')
    print(
        'Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія або ціль, саме ці здібності допоможуть швидше наблизитися до неї.'
    )
elif datetime.date(2023, 11, 23) <= user_date <= datetime.date(2023, 12, 21):
    print('Ти Стрілець')
    print(
        '2023 год у Стрельцов будет очень насыщенный. Звезды советуют на первое место поставить родственные связи - именно близкие люди помогут вам решить возникшие  проблемы и неурядицы.'
    )
elif datetime.date(2023, 10, 24) <= user_date <= datetime.date(2023, 11, 22):
    print('Ти Скорпіон')
    print(
        'Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія або ціль, саме ці здібності допоможуть швидше наблизитися до неї.'
    )
elif datetime.date(2023, 9, 24) <= user_date <= datetime.date(2023, 10, 23):
    print('Ти Терези')
    print(
        'У 2023 році Терезам слід бути більш відкритими та комунікабельними – і перед вами відкриються багато дверей, кажуть зірки. Ви налагодите стосунки з колегами й заведете потрібні знайомства. Рік обіцяє бути для вас дуже енергійним, і вам слід бути готовими до такого калейдоскопа подій.'
    )
elif datetime.date(2023, 8, 22) <= user_date <= datetime.date(2023, 9, 23):
    print('Ти Діва')
    print(
        'У 2023 році у Діви все буде благополучно. Але зірки радять – щоб і далі все було добре, раціонально поєднуйте фінанси й стосунки. Великих змін рік не обіцяє: ви будете працювати й досягати поставлених цілей, а значить, ваш матеріальний добробут буде рости.'
    )
elif datetime.date(2023, 7, 23) <= user_date <= datetime.date(2023, 8, 21):
    print('Ти Лев')
    print(
        'У 2023 році Льви боротимуться за своє місце під сонцем. На жаль, на удачу покладатися не варто – всього доведеться досягати важкою працею, як на роботі, так і у навчанні. Зірки не пророкують будь-яких проблем, але попрацювати треба буде серйозно.'
    )
elif datetime.date(2023, 6, 22) <= user_date <= datetime.date(2023, 7, 27):
    print('Ти Рак')
    print(
        'У Раків у 2023 році – сприятливий період. Удача буде супроводжувати вас весь рік: і на роботі, й у фінансах, і у коханні. Головне, вирішуйте в першу чергу дійсно важливі справи й не звертайте уваги на дрібниці.'
    )
elif datetime.date(2023, 5, 22) <= user_date <= datetime.date(2023, 6, 21):
    print('Ти Близнята')
    print(
        'Близнюкам у 2023 році пощастить – вдасться уникнути серйозних проблем. Взагалі, рік буде дуже вдалим у всіх сферах життя. А з якимись дрібними негараздами ви впораєтеся на раз-два, але тільки не гарячкуйте і не поспішайте.'
)
elif datetime.date(2023, 4, 21) <= user_date <= datetime.date(2023, 5, 21):
    print('Ти Телець')
    print(
        '2023 рік подарує Тельцям масу успішних справ і цікавих проєктів. Не бійтеся цієї лавини – удача буде супроводжувати вас у всіх починаннях. Головне – правильно розставте пріоритети й беріться лише за справи, які того варті, хоча, на перший погляд, вони можуть здаватися нездійсненними.'
)
elif datetime.date(2023, 3, 21) <= user_date <= datetime.date(2023, 4, 20):
    print('Ти Овен')
    print(
        'У Овнів у 2023 році все прекрасно – це період нових досягнень і великих змін. Ви зможете успішно завершити всі раніше розпочаті справи. У роботі вас чекають успіхи й, цілком ймовірно, підвищення по кар\'єрних сходах і надбавка до зарплати. Але якщо надумаєте змінити рід діяльності, то зірки радять бути дуже обережними в цьому питанні й не поспішати.'
)
elif datetime.date(2023, 12, 22) <= user_date <= datetime.date(2024, 1, 20):
    print('Ти Козеріг')
    print(
        'Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі речі, як-от хобі.'
    )
print('Все ок')
